export enum CODE {
  /**
   * 请求成功
   */
  CODE_10000 = 10000,

  /** 用户状态码*/
  /**
   * 未登录
   */
  CODE_10001 = 10001,
  /**
   * 账号不存在或者密码错误
   */
  CODE_10002 = 10002,
  /**
   * 账号已被锁定，请与管理员联系
   */
  CODE_10003 = 10003,
  /**
   * 登录未授权
   */
  CODE_10004 = 10004,
  /**
   * 请勿重复登录
   */
  CODE_10005 = 10005,
  /**
   * 验证码不正确
   */
  CODE_10008 = 10008,
  /**
   * 验证码已过期
   */
  CODE_10009 = 10009,
  /**
   * 参数错误
   */
  CODE_11001 = 11001,

  /** 角色状态码*/

  /**
   * 角色等级不够
   */
  CODE_20001 = 20001,
  /**
   * 被禁言
   */
  CODE_20002 = 20002,

  /** 权限状态码*/

  /**
   * 无权限
   */
  CODE_30001 = 30001,
  /**
   * 文本内容含有敏感词汇
   */
  CODE_30002 = 30002,

  /** 话题状态码*/

  /**
   * 话题未找到
   */
  CODE_40001 = 40001,
  /**
   * 库存不足
   */
  CODE_40002 = 40002,
  /**
   * 积分不足
   */
  CODE_40003 = 40003,
  /**
   * 奖品已不存在
   */
  CODE_40004 = 40004,

  /** 话题回复状态码*/
  /**
   * 话题回复未找到
   */
  CODE_50001 = 50001,
  /**
   * 话题回复添加失败
   */
  CODE_50002 = 50002,
  /**
   * 话题回复修改失败
   */
  CODE_50003 = 50003,
  /**
   * 话题回复已被锁定
   */
  CODE_50004 = 50004,
  /**已结题，暂不能回复 */
  CODE_50005 = 50005,

  /** 评论状态码*/
  /**
   * 评论未找到
   */
  CODE_60001 = 60001,
  /**评论添加失败 */
  CODE_60002 = 60002,
  /**评论已被锁定 */
  CODE_60003 = 60003,

  /** 通知状态码*/

  /**通知对象未找到 */
  CODE_80001 = 80001,

  /** 文件状态码*/

  /**文件未找到 */
  CODE_90001 = 90001,
  /**文件路径不能为空 */
  CODE_90002 = 90002,
  /**文件后缀不能为空 */
  CODE_90003 = 90003,
  /**文件内容为空 */
  CODE_90004 = 90004,
  /**文件上传失败 */
  CODE_90005 = 90005,
  /**Excel文件未找到 */
  CODE_91001 = 91001,
  /**该文件非Excel文件 */
  CODE_91002 = 91002,
  /**Excel文件转储失败 */
  CODE_91003 = 91003,
  /**Excel文件转储过程中发生异常 */
  CODE_91004 = 91004,
}

export default class HttpCode {
  private static messageMap = {
    [CODE.CODE_10000]: '请求成功!',
    [CODE.CODE_10001]: '尚未登录!',
    [CODE.CODE_10002]: '账号不存在或者密码错误!',
    [CODE.CODE_10003]: '账号已被锁定，请与管理员联系!',
    [CODE.CODE_10004]: '登录未授权!',
    [CODE.CODE_10005]: '请勿重复登录!',
    [CODE.CODE_10008]: '验证码不正确!',
    [CODE.CODE_10009]: '验证码已过期!',
    [CODE.CODE_11001]: '头衔列表未找到!',

    [CODE.CODE_20001]: '您的角色等级低，请先提高等级!',
    [CODE.CODE_20002]: '您的账号已被锁定，请联系管理员!',

    [CODE.CODE_30001]: '您的账号暂无该权限!',
    [CODE.CODE_30002]: '文本内容含有敏感词汇:',

    [CODE.CODE_40001]: '话题未找到!',
    [CODE.CODE_40002]: '库存不足!',
    [CODE.CODE_40003]: '积分不足!',
    [CODE.CODE_40004]: '奖品已不存在!',

    [CODE.CODE_50001]: '该回复未找到!',
    [CODE.CODE_50002]: '该回复失败!',
    [CODE.CODE_50003]: '该回复修改失败!',
    [CODE.CODE_50004]: '该回复已被锁定!',
    [CODE.CODE_50005]: '已结题，暂不能回复!',

    [CODE.CODE_60001]: '该评论未找到!',
    [CODE.CODE_60002]: '不能给自己评论!',
    [CODE.CODE_60003]: '该评论已被锁定!',

    [CODE.CODE_80001]: '通知对象未找到!',

    [CODE.CODE_90001]: '文件未找到!',
    [CODE.CODE_90002]: '文件路径不能为空!',
    [CODE.CODE_90003]: '文件后缀不能为空!',
    [CODE.CODE_90004]: '文件内容为空!',
    [CODE.CODE_90005]: '文件上传失败!',
    [CODE.CODE_91001]: 'Excel文件未找到!',
    [CODE.CODE_91002]: '该文件非Excel文件!',
    [CODE.CODE_91003]: 'Excel文件转储失败!',
    [CODE.CODE_91004]: 'Excel文件转储失败!',
  }
  static getMessage(code: CODE) {
    return HttpCode.messageMap[code]
  }
}
